## Staging: cognito
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`


**⚠️ &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
user_pool.tf
```




```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cognito_user_pool.forms will be created
  + resource "aws_cognito_user_pool" "forms" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "forms_user_pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true

          + invite_message_template {
              + email_message = "Welcome!  Please log in using the following credentials:/n  Username: {username}/n  Password: {####}"
              + email_subject = "Welcome to GCForms"
              + sms_message   = "Welcome!  Please log in using the following credentials:/n  Username: {username}/n  Password: {####}"
            }
        }

      + email_configuration {
          + email_sending_account = "COGNITO_DEFAULT"
          + from_email_address    = "noreply.forms-formulaires@cds-snc.ca"
        }

      + password_policy {
          + minimum_length    = 8
          + require_lowercase = true
          + require_numbers   = true
          + require_symbols   = true
          + require_uppercase = true
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + username_configuration {
          + case_sensitive = true
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # aws_cognito_user_pool_client.forms will be created
  + resource "aws_cognito_user_pool_client" "forms" {
      + allowed_oauth_flows                  = [
          + "code",
        ]
      + allowed_oauth_flows_user_pool_client = true
      + allowed_oauth_scopes                 = [
          + "email",
          + "openid",
          + "profile",
        ]
      + callback_urls                        = [
          + "https://forms-staging.cdssandbox.xyz/api/auth/callback/cognito",
        ]
      + client_secret                        = (sensitive value)
      + enable_token_revocation              = (known after apply)
      + id                                   = (known after apply)
      + logout_urls                          = (known after apply)
      + name                                 = "forms_client"
      + prevent_user_existence_errors        = (known after apply)
      + refresh_token_validity               = 30
      + supported_identity_providers         = [
          + "COGNITO",
        ]
      + user_pool_id                         = (known after apply)
    }

  # aws_secretsmanager_secret_version.cognito_client_secret will be created
  + resource "aws_secretsmanager_secret_version" "cognito_client_secret" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:cognito_client_secret-ZjdUZU"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cognito_client_id         = (known after apply)
  + cognito_client_secret_arn = (known after apply)
  + cognito_endpoint_url      = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cognito_user_pool.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.cognito_client_secret"]

19 tests, 17 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
